docs/reportar.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es"><head><meta http-equiv="Content-Type" content="text/html;charset=utf-8"><meta name="viewport" content="width=device-width, initial-scale=1"><title>Cómo preguntar dudas e informar de errores</title><meta name="author" content="Carlos León"><meta name="generator" content="Org Mode"></head><body> <div id="content" class="content"> <h1 class="title">Cómo preguntar dudas e informar de errores</h1> <div id="outline-container-cuando-surgen-los-errores" class="outline-2"> <h2 id="cuando-surgen-los-errores"><span class="section-number-2">1.</span> Cuando surgen los errores</h2> <div class="outline-text-2" id="text-cuando-surgen-los-errores"> <p> Es normal (y positivo) que, durante el desarrollo de la asignatura, surjan errores de código y ejecución. Cuando sea así, podéis y debéis preguntar tanto a vuestros compañeros como al equipo docente. </p> </div> </div> <div id="outline-container-antes-de-preguntar" class="outline-2"> <h2 id="antes-de-preguntar"><span class="section-number-2">2.</span> Antes de preguntar</h2> <div class="outline-text-2" id="text-antes-de-preguntar"> <ol class="org-ol"> <li>Busca en la documentación de la asignatura.</li> <li>Busca en Internet (<a href="http://stackoverflow.com/">Stack Overflow</a>, Google&#x2026;) si los problemas son generales (librería, lenguaje&#x2026;)</li> <li>Intenta arreglarlo. Piensa, reduce el error al mínimo.</li> <li>Depura (<code>print</code> funciona, pero usa depuración gráfica)</li> <li>Identifica qué puede ir mal</li> </ol> <p> Ten en cuenta que cada pregunta requiere tiempo tuyo, de tus compañeros y de tus profesores. Y a nadie le sobra. Además, aunque sea cómodo y tentador preguntar sin haber hecho el trabajo primero, buscar e intentar encontrar la solución <b>es el mejor camino para convertirse en un buen programador</b>. </p> <p> Pero, por supuesto, no tiene sentido buscar como locos durante una semana. Si, tras una búsqueda razonable, no habéis encontrado nada, es el momento de hacer la pregunta. </p> </div> </div> <div id="outline-container-cómo-preguntar" class="outline-2"> <h2 id="cómo-preguntar"><span class="section-number-2">3.</span> Cómo preguntar</h2> <div class="outline-text-2" id="text-cómo-preguntar"> <p> Imaginad que llamáis al médico, y tenéis la siguiente conversación: </p> <p> &#x2014;Doctor, me encuentro mal.<br> &#x2014;Bien, dígame, ¿cómo puedo ayudarle?<br> &#x2014;No sé, no estoy bien. Intento estar bien, pero no lo consigo. Tengo síntomas extraños. No estoy como me gustaría. <b>¿Qué me pasa?</b> </p> <p> Puede parecer una broma, pero es posible que esto os suene más real: </p> <p> &#x2014;Profesor, mi práctica no funciona.<br> &#x2014;Bien, dime, ¿cómo puedo ayudarte?<br> &#x2014;No sé, no va bien. Intento que funcione, pero no lo consigo. Me da un error extraño. No imprime lo mismo que dice el enunciado. <b>¿Qué he hecho mal?</b> </p> <p> Aunque exagerándolo, y con un poco de humor, este tipo de descripciones es normal. Es imposible dar una respuesta con tan poca información. </p> </div> <div id="outline-container-cómo-formulo-mi-error" class="outline-3"> <h3 id="cómo-formulo-mi-error"><span class="section-number-3">3.1.</span> ¿Cómo formulo mi error?</h3> <div class="outline-text-3" id="text-cómo-formulo-mi-error"> <p> Para tener una solución, hay que hacer un diagnóstico. Y, para tener un diagnóstico, hacen falta <b>datos</b>. Dado que estamos programando, vuestros datos son: </p> <ul class="org-ul"> <li>El código. Tenéis que poner todo el código relevante (no sólo una línea, e idealmente poner un enlace a un commit/repo, o mediante <a href="http://pastebin.com/">pastebin</a> o <a href="https://gist.github.com/">Gist</a>).</li> <li>Las versiones de intérpretes, navegadores y demás que usáis: salida de <code>compilador --version</code>, versión del navegador, etc.</li> <li>La salida por consola: intentad evitar capturas de pantalla. Copiad y pegad texto. Usad <a href="http://pastebin.com/">pastebin</a>. En el caso del navegador, sin embargo, una captura puede ser útil.</li> <li><b>No peguéis fotos de código, pegad el código (como texto)</b>.</li> <li>La secuencia que habéis seguido para que os dé el error (si es de ejecución). Una lista, ordenada, paso a paso, para reproducir el error: <ol class="org-ol"> <li>Ejecuto <code>node init.js</code></li> <li>Cuando sale el menú (ejemplo en <a href="http://pastebin.com/s2n986aund">http://pastebin.com/s2n986aund</a>), elijo <code>0</code>.</li> <li>El error salta.</li> </ol></li> </ul> </div> </div> <div id="outline-container-ejemplo" class="outline-3"> <h3 id="ejemplo"><span class="section-number-3">3.2.</span> Ejemplo</h3> <div class="outline-text-3" id="text-ejemplo"> <blockquote> <p> Hola a todos: </p> <p> Estoy con la práctica 15 y tengo un error extrañísimo. El entrar en el menú de opciones y elegir "aplastar enemigo con alegría", me dice que no se puede llamar a <code>undefined</code>. </p> <p> Yo 1. arranco con <code>node init.js</code>, 2. elijo "aplastar enemigo", 3. elijo "aplastar con alegría", y me sale el error que podéis ver en <a href="http://pastebin.com/s2n986aund">http://pastebin.com/s2n986aund</a>. </p> <p> Mi código está en Github, en alumnofiera267/practica7, en el commit <code>a56afde34</code>&#x2026; </p> <p> Una captura de lo que me sale en el navegador está en <a href="https://imagebin.ca/v/32HTFG3qbe4k">https://imagebin.ca/v/32HTFG3qbe4k</a>. </p> <pre class="example" id="orga9fd2cd">
# node --version
v4.6.1 
</pre> <pre class="example" id="orgf5c1ed8">
# chromium --version 
Chromium 54.0.2840.100
</pre> <p> ¡Gracias! </p> </blockquote> </div> </div> <div id="outline-container-dónde-pongo-la-pregunta" class="outline-3"> <h3 id="dónde-pongo-la-pregunta"><span class="section-number-3">3.3.</span> ¿Dónde pongo la pregunta?</h3> <div class="outline-text-3" id="text-dónde-pongo-la-pregunta"> <p> En el foro del Campus Virtual. </p> <p> Cualquier pregunta privada ocurre varias veces, todos los años. Si vuestra pregunta está en el foro, todos podrán beneficiarse de la solución, además de que otro compañero puede ayudaros y, a veces, con menos retraso que el equipo docente (estamos siempre atentos, pero no damos abasto muchas veces). </p> </div> </div> </div> <div id="outline-container-compartir-es-positivo" class="outline-2"> <h2 id="compartir-es-positivo"><span class="section-number-2">4.</span> Compartir es positivo</h2> <div class="outline-text-2" id="text-compartir-es-positivo"> <p> No tengáis miedo de compartir material. Mostrar el código y leer código de los demás es muy didáctico y facilita la colaboración. El valor no está en el uso que se le dé a vuestro código, <b>lo que tiene valor es lo que aprendéis mientras lo escribís</b>. </p> </div> <div id="outline-container-cuidado-con-las-copias" class="outline-3"> <h3 id="cuidado-con-las-copias"><span class="section-number-3">4.1.</span> Cuidado con las copias</h3> <div class="outline-text-3" id="text-cuidado-con-las-copias"> <p> Como se comenta en varios lugares, <b>copiar es ilegal, y supone suspender</b>. Una cosa es compartir código e información (que <i>siempre</i> es positivo) y otra muy distinta usar las líneas de código de otro en nuestra práctica. Recordad: estáis cursando este grado y esta asignatura porque queréis aprender. Aquel para quien no sea así, y sólo quiera aprobar y pasar a lo siguiente, debería replantearse si está en el sitio apropiado. </p> </div> </div> </div> </div> </body></html>